Autodesk.Revit.UI.IControllableDropHandler.CanExecute(Autodesk.Revit.UI.UIDocument,System.Object,Autodesk.Revit.DB.ElementId)
Implement this method to inform Revit whether the drop event can be executed onto the given view.
Remarks:
Document modifications are not permitted from this callback.
document: The document on which the data was dropped.
data: The data.
dropViewId: The view upon which the user will drop.
Returns:  Return true to activate the target view and execute the drop.
Return false to cancel the activation and the drop execution.

Autodesk.Revit.UI.IControllableDropHandler
An interface to be executed when custom data is dragged and dropped onto the Revit user interface.
This interface is different from IDropHandler in that it allows the handler to verify whether the drop event can be executed on the given view.
Remarks:
Custom data is supported for drag and drop only during an invocation of the DoDragDrop method on Application.
Since:
2015

Autodesk.Revit.UI.IControllableDropHandler.CanExecute(Autodesk.Revit.VSTA.DocumentEntryPoint,System.Object,Autodesk.Revit.DB.ElementId)
Implement this method to inform Revit whether the drop event can be executed onto the given view.
Remarks:
Document modifications are not permitted from this callback.
document: The document on which the data was dropped.
data: The data.
dropViewId: The view upon which the user will drop.
Returns:  Return true to activate the target view and execute the drop.
Return false to cancel the activation and the drop execution.